

从2009年中本聪发布比特币以来，比特币以去中心化，密码学保护，能够实现数据一致性存储，防篡改的优势逐渐为人们所熟知，区块链技术也从幕后走向了前台，从开始的1.0货币，2.0金融到现在3.0应用，人们重新定义了区块链， 赋予区块链更强大的力量。
区块链以其诸多优势迅速成为子资本的宠儿，被应用在金融，保险，支付，版权，溯源，公益，物联网等领域，试图改变甚至颠覆传统的中心化，缺乏信任的运营模式，而到目前为止， 区块链应用依然没有大规模落地，究其原因在于区块链还面临着诸多短板尚未解决， 接下来我们谈一谈truechain是如何解决这些问题的。
1. 性能
区块链的性能主要取决于共识算法， 比特币的成功已经证实了POW共识机制是没有问题的，但是也存在局限性。 POW机制可以很好的接纳无限的新节点， 同时也造成了大量能源的消耗，每秒7笔的交易量难以提升。Truechain作为一个公链，在保证新节点接入的同时，还必须 保证有足够高的交易处理量，显然，采用单一的共识机制难以兼顾去中心和效率。True采用混合共识机制设计，致力于提供高性能的价值传输设施，以POW为基础， 选举产生PBFT主干节点的混合机制，可以保证主干节点通讯效率支持10，000-100，000TPS，同时保证多个智能合约和商业应用同时处理交易时全链通讯不受到阻塞。
2. 无限节点接入
Truechain采用的以POW为基础，结合PBFT的共识机制很好的满足了无限节点接入的需要。
3. 统一标准
在国家，资本的推动下，区块链发展如火如荼，区块链项目和团队不仅让人联想到智能家居的发展初期，各个厂家都在制定自有的标准体系，导致市面上产品多种多样，但无法共享互通，而区块链解决了数据防篡改问题， 若不能建立统一的标准， 数据无法在链内互通，则无法发挥数据的价值，这也是值得每一个区块链团队思考的问题。
4. 安全
单纯PBFT无法保证全体节点参与决策，所以存在比较强的道德风险及安全隐
患。少量节点的不作为或宕机可能导致其他节点的数据被篡改或全链瘫痪。 以POW 为基础， 选举产生 PBFT 主干节点的混合共识机制设计可以保证 PBFT 主干节点出现安全问题时及时进行重新选举，并对主干节点进行实时监督。
5. 监管
区块链技术采用“去中心化”的技术设计，避免了传统中心化经济系统结构中的诸多问题，但去中心化也意味着主体不明确，监管难以对主体进行有效控制。如何正确的利用区块链技术，在保证区块链优势的同时，避开政府红线，增强政府的监管力量，也是值得考虑的问题。
最后， 区块链技术仍处于早期探索阶段，大多数项目应用落地还比较困难，还需要更多的科技工作者投入。在中国这个大背景下， 以发币为目的的区块链项目终将会走向终结， 区块链技术应当尽快与传统行业结合，寻找行业痛点，应用落地才是出路。

