True黄皮书让我来解读
1、对初链的认识：
  初链（TRUEChina）是一种通用型公链，同时也是一种给商业应用提供基础设施的底层公链，其愿景是打造承载未来商用去中心化的应用，是全球最早实现PBFT-POW混合
共识机制设计的公链之一。解决了公有链领域去中心化和性能之间的矛盾。

2、技术架构：
初链的技术架构由下而上分为三层：混合共识机制、智能合约、合约抽象
①　PBFT-POW混合共识机制：
通俗易懂来讲，就是用PFBT来快速更新账本；用PoW来验证交易，辅助PBFT的成员变动，保留 PBFT 记录账本的机制不动，将超级节点的选取开放给公链，利用 POW 协议作
为准系统支持超级节点的动态选取和协议达成，将主干节点社区的组建由私有链与联盟链性质转换为公有链性质。PBFT协议保证价值流通和商业应用所需要的性能，而POW协
议保证去中心化。
②　智能合约
智能合约的运行必须依靠虚拟机完成，保证统一智能合约在不同环境下可以运算得到同一结果。初链继承了以太坊的虚拟机（EVM）的设计思路，在 PBFT 上推出 TVM。
TVM 将植入每一个进行决策的主干结点，使得它们能根据单个需求进行调用请求。但TVM的构想还并不是很成熟,需要确定TVM的过渡状态、智能合约部署策略及从私链虚拟机
向公链虚拟机的转变。同时还要确定从POW节点向PBFT节点转变的参数。
③　合约抽象
合约抽象层将抽象智能合约中的基本商业逻辑，简化开发者设置复杂智能合约的流程。

3、奖励机制:
初链的混合共识机制运用公平的、随机抽取的、轮换的社区制度天然地避免了持币者拥有持续性地获得大量奖励,从而保证了财富的公平分配。为补偿计算算力的不均匀性,
初链设置了从BFT与POW池获得奖励的奖励机制。在工程设计上,利用标识改变工作分配,让BFT交易、POW、激励池依次获得资源分配的优先级。通过这种方式,如果BFT节点
由于K天数限制(最多每K天必须更换一次节点)被清出网络,它仍可以通过为网络其余部分提供补偿机制享受到投资硬件产生的收益。所有的节点都能完成POW和PBFT的任务,
但是PBFT获得更高的优先级。
4、初链未来的优化方向：
改进所有节点的时间戳同步，而不需要中心化的NTP服务器。
喜欢奖励基础设施里的激励技术，这样重度投资基础设施的投资人不会遭遇“被忽视”，“亏本”的问题。
支持副本创建的分片技术，尽量减少被BFT会员会拒绝的交易集。
添加零知识证明以增强隐私。
EVM、TVM和Linux容器技术的混合基础设施。
改进虚拟机规范中的二进制数据编码方法，交易签名，收费表等章节。
5、总结：
	初链的共识设计具有同样的一致性、活跃度、交易终结性和安全保障，这是与混合共识事实上的一致。讨论了轮值委员会成员的频率和物理时间戳限制等优化问题。
  提出了在以太坊之上建立一个新的虚拟机的想法，它在无权限的设置中增加了基于许可链的交易处理功能。还使用数据共享和投机交易的思想，评估混合云基础设施中智
  能合约的运行情况，使用现有的志愿计算协议来实现引入的补偿基础结构。



以上为本人对于初链黄皮书的理解。
