## 1.蓬勃发展的区块链
互联网的高度普及使人类从工业社会迈入信息社会，而区块链技术的出现，又是对互联网技术更上一层的技术革新。区块链思想最早出现在大名鼎鼎的比特币开源项目中。比特币项目在诞生和发展过程中，借鉴了来自数字货币、密码学、博弈论、分布式系统、控制论等多个领域的技术成果，作为其核心支撑的区块链技术更是令人数目的创新成果。区块链技术的诞生为社会中实体货币虚拟化提供了可能，同时货币自身的价值依托也不断地发生演化，从最早的实物价值到今天对科学技术和信息系统的信任价值。 如果说比特币是影响力巨大的社会科学实验，那么从比特币核心设计中提炼出来的区块链技术，则让大家看到了塑造更高效、更安全的未来商业网络的可能。实际上，人们很早就意识到，记账相关的技术对于资产的管理十分关键，而去中心化或多中心化的分布式记账技术，对于当前开放的、多维化的商业模式意义重大。区块链的思想和结构，正是实现这种分布式记账系统的一种极具可行的技术。区块链技术早已经脱离比特币网络自身，在金融、贸易、征信、物联网等领域崭露头角。可以说，区块链技术正迅猛地在各个行业发展着。

## 2.初链
### 初链：高性能去中心化公开账本
众所周知，区块链共分为三类：私有链、公链、联盟链。对于任何一个链种，共识机制的设计是它的绝对核心，其需要足够去中心化以实现安全性，又需要高运行速度以保证性能。初链是一个快速、不受限、安全、可扩容PBFT-fPoW混合共识公链。初链选择了将PBFT 的高效与 POW 的去中心化相结合的混合共识机制。在去中心化本质的基础上，实现高性能、高可靠性的公链开发。初链在保留原有PBFT 记录账本的机制不动，将超级节点的选取开放给公链，支持超级节点的动态选取和协议，将节点的组建由私有链与联盟链性质转换为公有链。这种新的共识机制使得初链成为高性能去中心化的公开账本。

随着区块链技术优势不断体现，在各个领域都相继有成功的区块链应用落地实现。区块链应用解决方案，在市场上需求也越来越大。基于混合共识机制设计的初链，在保持去中心化本质的同时，采用POW与PBFT相结和的混合共识机制，必然会在区块链上的发展道路上贡献出更多的力量。

### 混和共识机制：和而不同
上面，我一直在说初链使用了混合机制，那么什么是混合机制？简而言之，混合机制就是集各个共识机制之所长，充分发挥各个共识机制所特有的优势来达到目标。

初链混合共识机制的核心就是POW + PBFT。在初链的混合机制中，首先保留PBFT记录账本的机制不动，将超级节点的选取开放给公链，这样提高了共识机制的效率。而各个共识节点由业务的参与方或者监管方组成，安全性与稳定性由业务相关方保证，共识的时延大大缩减。其次，初链利用 POW 协议作为准系统支持超级节点的动态选取来实现完全去中心化。并且将PBFT和POW共识结合在一起，同时也解决了去中心化和性能的矛盾。

并且，初链的 POW采用了一个叫“水果链”共识。水果链共识机制下，加入网络的节点都可以比较容易的挖矿，每个区块都有相应的保质期，拥有保质期内区块节点即使没有挖到矿，也可以享受到其它节点的挖矿收益分配。这就是说大家可以共享挖矿收益，从而降低了人为大矿池垄断算力的动机，使整个网络更加的去中心化。

### 初链的技术架构
我们先来看看初链的技术架构图：
![](https://upload-images.jianshu.io/upload_images/1035930-97cab3a82fc0246d.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/558)


总共划分为4层：

底层服务：包含P2P 网络、LevelDB 数据库、密码学算法、分片优化
核心层：包含区块链模块、TRUE 模块、共识算法模块
API 接口层：包括 TVM 虚拟机、gRPC协议；
智能合约层：支持智能合约的部署

在初链的架构中，不同于其他的链的地方首先在于核心层中的共识算法模块，选择了将 PBFT 的高效与 POW 的去中心化相结合的混合共识机制。其次，初链在PBFT上推出TVM。将植入每一个进行决策的主干结点，使得它们能根据单个需求进行调用请求。通过智能合约来落地应用共识机制。

### 初链的产品矩阵
来看看初链白皮书中规划的产品矩阵图：
![](https://upload-images.jianshu.io/upload_images/1035930-44aaeb97876f2fab.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/378)


初链轻钱包为节点提供接收、发送、管理全部初链数字资产 等服务。

Stellar 为商用 Dapp 开发者提供便捷、稳定、高效率的智 能合约开发平台，开发者可以对合约进行全生命周期的管理。

Dapp Warehouse 为面向用户的 Dapp 下载平台。

TrueScan 作为初链的区块链浏览器，为节点提供合约监控、 交易统计、账本查询、隐私保护等服务。

### 初链：未来可期
打造承载未来商用去中心化应用的公链，是时代的需求，也是初链的梦想。基于混合共识机制设计的初链，旨在为社会提供高速点对点通信、价值传输以及智能合约基础设施。我相信，初链必将会在区块链上的发展道路上走得更远，贡献出更多的力量。初链，未来可期！
